// 1-Тапсырма: Жасына Сәйкестігін Тексеру
let age = 18; // кез келген жас мәнін қойыңыз
if (age > 16) {
    console.log("Жасы 16-дан асқан");
} else {
    console.log("Жасы 16-ға жетпеген немесе кіші");
}

// 2-Тапсырма: Жұп Немесе Тақ Сан
let num = 7; // кез келген сан мәнін қойыңыз
if (num % 2 === 0) {
    console.log("жұп");
} else {
    console.log("тақ");
}

// 3-Тапсырма: Температураны Тексеру
let temperature = 25; // кез келген температура мәнін қойыңыз
if (temperature >= 20 && temperature <= 30) {
    console.log("Температура 20-дан 30 градусқа дейінгі диапазонда");
} else {
    console.log("Температура диапазонда емес");
}

// 4-Тапсырма: Санның Оң Екенін Тексеру
num = -5; // кез келген сан мәнін қойыңыз
if (num > 0) {
    console.log("Сан оң");
} else {
    console.log("Сан оң емес");
}

// 5-Тапсырма: 5 Және 10-Ға Еселік Тексеру
num = 50; // кез келген сан мәнін қойыңыз
if (num % 5 === 0 && num % 10 === 0) {
    console.log("шын");
} else {
    console.log("жалған");
}